Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་བསྡུས་ནས་རྣམ་པར་རྟོག་པར་མི་བྱེད་པའི་ཕྱིར་དང་། རྟག་པར་རྣམ་པར་གྲོལ་བར་སྨོན་ཅིང་མཐའ་གཉིས་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་པའི་ཕྱིར་དང་། མངོན་པར་ཤེས་པ་ཐོབ་ནས་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་སྨོན་པའི་ཕྱིར་དང་། ཆོས་ཀྱི་དབྱིངས་ཡོངས་སུ་སྦྱངས་ནས་སེམས་ཀྱི་དྲི་མ་སེལ་བར་བྱེད་པའི་ཕྱིར་དང་། སེམས་ཅན་གྱི་ཉོན་མོངས་པའི་རྩ་བ་ཡོངས་སུ་གཅོད་པར་བྱེད་པའི་ཕྱིར་ཏེ།
en: They are (1) gathering good qualities and not creating thoughts; (2) always aspiring to liberation and having no attachment to the two extremes; (3) attaining the higher cognitions and ripening the good roots of beings; (4) purifying the Dharma realm and eliminating the stains of the mind; and (5) cutting through the kleśa roots of beings. “

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཞེས་བྱའོ།
en: Noble one, these complete the perfection of meditation of the bodhisattvas mahāsattvas. “

source: །རིགས་ཀྱི་བུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཆོས་རྣམ་པ་ལྔ་ལ་བརྟེན་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Noble one, the bodhisattvas mahāsattvas complete the perfection of wisdom through five qualities.

source: །ལྔ་གང་ཞེ་ན། རྟག་པར་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་།
en: What are those five?

source: གསལ་ཞིང་ཐབས་མཁས་པ་ཐམས་ཅད་ལ་མཆོད་ཅིང་ཉེ་བར་བརྟེན་ནས་ཡོངས་སུ་སྐྱོ་བ་མི་སྐྱེད་ཅིང་རྒྱབ་ཀྱིས་ཕྱོགས་པར་མི་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཆོས་ཟབ་མོ་བཤད་པ་དེ་དག་སེམས་ཀྱིས་རྟག་ཏུ་ཐོས་པར་མོས་ཤིང་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། ཆོག་པའི་བསམ་པ་མེད་པ་དང་། དོན་དམ་པ་དང་། ཀུན་རྫོབ་ཀྱི་ཤེས་རབ་དམ་པས་རབ་ཏུ་རྣམ་པར་འབྱེད་པར་མོས་པ་དང་། བསྒོམས་པས་སྤང་བར་བྱ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་མྱུར་དུ་སྤོང་བ་དང་།
en: They are (1) always making offerings to and closely relying on all the buddhas and bodhisattvas, who have clarity and skill in methods, and not wearying or turning back; (2) always aspiring in the mind to hear the tathāgatas teach the profound Dharma without ever feeling that it is enough; (3) aspiring to examine through the sublime ultimate and relative wisdoms; (4) quickly eliminating all kleśas, which are to be eliminated through meditation; and (5) understanding the qualities of the five fields of knowledge. “

source: འཇིག་རྟེན་པའི་མཁྱུད་དཔྱད་དང་། རིག་པའི་གནས་ལྔའི་ཆོས་ཐམས་ཅད་མངོན་པར་རྟོགས་པ་གང་ཡིན་པ་སྟེ། རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཞེས་བྱའོ།
en: Noble one, these complete the perfection of wisdom of the bodhisattvas mahāsattvas. “

source: །རིགས་ཀྱི་བུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཆོས་རྣམ་པ་ལྔ་ལ་བརྟེན་ནས་ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Noble one, the bodhisattvas mahāsattvas complete the perfection of skill in methods through five qualities.

source: །ལྔ་གང་ཞེ་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མོས་པ་དང་། ཉོན་མོངས་པ་དང་།
en: What are those five?

source: སེམས་ཀྱི་སྤྱོད་པའི་བྱེ་བྲག་ཐམས་ཅད་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་དང་། ཆོས་ཚད་མེད་པ་རྣམས་ཀྱི་གཉེན་པོའི་སྒོ་ཐམས་ཅད་སེམས་ཀྱིས་གསལ་བར་རྟོགས་པ་དང་། བྱམས་པ་དང་། སྙིང་རྗེ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་ལས་འབྱུང་ཞིང་འཇུག་པ་དག་ལ་རང་དབང་ཐོབ་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་བསྒོམས་ནས་ཡོངས་སུ་སྨིན་ཅིང་ཕུན་སུམ་ཚོགས་པར་བྱ་བར་མོས་པ་དང་།
en: They are (1) understanding and comprehending the particular aspirations, kleśas, and mental conduct of all beings; (2) understanding clearly in the mind all the gateways of remedies in the limitless Dharmas; (3) attaining mastery of rising out of and entering into the samādhis of great love and compassion; (4) aspiring to attain ripening and excellence through meditation on the perfections; and (5) aspiring to gather and realize all the qualities of buddhahood without exception. “

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མ་ལུས་པར་ཡོངས་སུ་བསྡུས་ནས་མངོན་པར་རྟོགས་པར་སྨོན་པ་གང་ཡིན་པ་སྟེ། རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཐབས་མཁས་པ་ཡེ་ཤེས་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཞེས་བྱའོ།
en: Noble one, these complete the perfection of skill in methods of the bodhisattvas mahāsattvas. “

source: །རིགས་ཀྱི་བུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཆོས་རྣམ་པ་ལྔ་ལ་བརྟེན་ནས་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Noble one, the bodhisattvas mahāsattvas complete the perfection of prayer through five qualities.

source: །ལྔ་གང་ཞེ་ན། ཆོས་ཐམས་ཅད་གཟོད་མ་ནས་མི་སྐྱེ་མི་འགོག །ཡོད་པ་མ་ཡིན།
en: What are those five?

source: མེད་པ་ཡང་མ་ཡིན་པ་དག་ལ་སེམས་བདེ་བར་གནས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཚུལ་མཆོག་དམ་པ་དག་ལ་དྲི་མ་དང་བྲལ་ཞིང་རྣམ་པར་དག་པར་སོ་སོར་བརྟགས་ནས་སེམས་བདེ་བར་གནས་པ་དང་། མཚན་མ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་སེམས་ཀྱི་དེ་བཞིན་ཉིད་མངོན་པར་འདུ་བྱ་བ་མེད་པ། སྤྱོད་པ་མེད་པ། ཐ་དད་པ་མ་ཡིན་པ། མི་གཡོ་བ་དག་ལ་སེམས་བདེ་བར་གནས་པ་དང་། སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པར་འདོད་པའི་ཕྱིར་ཀུན་རྫོབ་ཀྱི་བདེན་པ་དག་ལ་སེམས་བདེ་བར་གནས་པ་དང་།
en: They are (1) the mind being happily at rest concerning all phenomena being primordially unborn and unceasing and neither existent nor nonexistent; (2) the mind being happily at rest having examined the sublime, supreme nature of the meaning of all Dharmas, which is pure and stainless; (3) the mind being happily at rest in the true nature of the mind that transcends all features and is uncreated, without activity, without differences, and unshakable; (4) the mind being happily at rest in relative truth because of wishing to benefit beings; and (5) the mind being happily at rest in the simultaneous practice of śamatha and vipaśyanā. “

source: ཞི་གནས་དང་ལྷག་མཐོང་དུས་གཅིག་ཏུ་མཉམ་པར་སྤྱོད་པ་དག་ལ་སེམས་བདེ་བར་གནས་པ་གང་ཡིན་པ་སྟེ། རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཞེས་བྱའོ།
en: Noble one, these complete the perfection of prayer of the bodhisattvas mahāsattvas. “

source: །རིགས་ཀྱི་བུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཆོས་རྣམ་པ་ལྔ་ལ་བརྟེན་ནས། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Noble one, the bodhisattvas mahāsattvas complete the perfection of strength through five qualities.

source: ཡང་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དང་ལེགས་ཉེས་རབ་ཏུ་ཤེས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཤིན་ཏུ་ཟབ་ཅིང་གྱ་ནོམ་པའི་ཆོས་ལ་གཟུད་པར་བྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་བར་འཁོར་བ་དག་གི་ལས་ཀྱི་རྐྱེན་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་དང་རང་བཞིན་རྣམ་པ་གསུམ་ཡང་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་རྣམ་པར་འབྱེད་ཅིང་ཁོང་དུ་ཆུད་པར་བྱེད་པ་དང་། སེམས་ཅན་རྣམས་ལ་ཚུལ་བཞིན་དུ་ཡང་དག་པར་བསྟན་ནས་དགེ་བའི་རྩ་བ་བསྐྱེད་དེ།
en: They are (1) knowing, through the strength of true knowledge, the conduct of all beings, and the good and bad in their minds; (2) leading all beings into very profound and excellent Dharma; (3) knowing exactly and correctly the karmic factors of all beings who are circling in saṃsāra; (4) analyzing and comprehending through the strength of correct knowledge the faculties and the three natures in beings; and (5) correctly and appropriately teaching beings so that they develop good roots, ripening them and through the strength of knowledge liberating them. “

source: ཡོངས་སུ་སྨིན་པར་བྱས་ནས་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་ཡོངས་སུ་སྒྲོལ་བ་གང་ཡིན་པ་སྟེ། རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཞེས་བྱའོ།
en: Noble one, these complete the perfection of strength of the bodhisattvas mahāsattvas. “

source: །རིགས་ཀྱི་བུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཆོས་རྣམ་པ་ལྔ་ལ་བརྟེན་ནས་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Noble one, the bodhisattvas mahāsattvas complete the perfection of knowledge through five qualities.

source: ཆོས་རྣམས་ཀྱི་ལེགས་ཉེས་རབ་ཏུ་རྣམ་པར་འབྱེད་པར་བྱེད་པ་དང་། ནག་པོ་དང་། དཀར་པོའི་ཆོས་ཡོངས་སུ་མི་སྤོང་ཞིང་ཡང་དག་པར་སྡུད་པར་བྱེད་པ་དང་། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་དག་ལ་ཡོངས་སུ་མི་སྐྱོ་ཞིང་མངོན་པར་མི་དགའ་བ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་དང་ལྡན་པས་མཐར་ཐུག་པའི་གནས་སུ་ཕྱིན་པར་གྱུར་པ་དང་།
en: They are (1) distinguishing between good and bad qualities; (2) not rejecting but accumulating good qualities; (3) not being saddened by saṃsāra nor delighting in nirvāṇa; (4) reaching the ultimate state through possessing the practice of merit and wisdom; and (5) obtaining the supreme empowerment, and attaining the unique qualities of a buddha, and so on, and omniscient knowledge. “

source: དབང་བསྐུར་བ་མཆོག་ཐོབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་སོགས་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་གྱུར་པ་གང་ཡིན་པ་སྟེ། རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཞེས་བྱའོ།
en: Noble one, these complete the perfection of knowledge of the bodhisattvas mahāsattvas. “

source: །རིགས་ཀྱི་བུ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་གང་ཡིན་ཞེ་ན། འདི་ལྟ་སྟེ་ཕན་འདོགས་པ་མཆོག་མངོན་པར་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །ཤིན་ཏུ་ཟབ་པའི་ཡེ་ཤེས་ཆེན་པོ་ཚད་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །སྤྱོད་པ་དང་སྤྱོད་པ་མ་ཡིན་པའི་ཆོས་དག་ལ་སེམས་ཀྱིས་མངོན་པར་ཞེན་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །འཁོར་བའི་ཉེས་དམིགས་དང་། མྱ་ངན་ལས་འདས་པའི་ཡོན་ཏན་ཡང་དག་པར་རིག་ཅིང་ཡང་དག་པར་སོ་སོར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །གཏི་མུག་དང་ལྡན་པའི་གང་ཟག་དང་། ཤེས་རབ་དང་ལྡན་པའི་གང་ཟག་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །ཆོས་རིན་པོ་ཆེ་གྱ་ནོམ་པ་རྣམ་པ་སྣ་ཚོགས་རབ་ཏུ་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །ཐོགས་པ་མེད་པའི་རྣམ་པར་གྲོལ་བ་དང་། ཤེས་རབ་ཡོངས་སུ་རྫོགས་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །ཆོས་ཀྱི་ཁམས་དང་སེམས་ཅན་གྱི་ཁམས་ཡང་དག་པར་རྣམ་པར་ཕྱེ་ནས་ཤེས་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །སྦྱིན་པ་ལ་སོགས་པ་ནས་ཡེ་ཤེས་ཀྱི་བར་དག་ཕྱིར་མི་ལྡོག་པའི་གནས་སུ་ཕྱིན་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ།
en: Noble one, what is the meaning of perfection?

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །མངོན་པར་བྱང་ཆུབ་ནས་སངས་རྒྱས་ཀྱི་སྟོབས་བཅུ་དང་། བསྙེངས་པ་མི་མངའ་བ་བཞི་དང་། མ་འདྲེས་པའི་ཆོས་ལ་སོགས་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ལ་མཚན་ཉིད་གཉིས་སུ་མེད་པར་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །ཐམས་ཅད་ལ་ཕན་འདོགས་ཤིང་ཡོངས་སུ་ཟློས་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །མུ་སྟེགས་ཅན་ཐམས་ཅད་ཉེ་བར་འོངས་ནས་གང་འདྲི་བ་དག་ལ་ལེགས་པར་རྣམ་པར་བཤད་ནས་འདུལ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །ཆོས་ཀྱི་འཁོར་ལོ་ཤིན་ཏུ་གྱ་ནོམ་པ་རྣམ་པ་བཅུ་གཉིས་ཡོངས་སུ་བསྐོར་བ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ།
en: It is like this: that which accomplishes the supreme benefit is perfection; that which completes limitless, great, profound knowledge is perfection; the mind having no attachment to qualities of conduct or nonconduct is perfection; knowing and correctly discriminating between the faults of saṃsāra and the good qualities of nirvāṇa is perfection; gathering all individuals who have ignorance and who have wisdom is perfection; teaching the various kinds of excellent, precious Dharma is perfection; completing unimpeded liberation and wisdom is perfection; discriminating and knowing the nature of Dharmas and the nature of beings is perfection; reaching the state of nonregression from generosity, and so on, up to knowledge is perfection; completing the patience of the quality of birthlessness is perfection; ripening the good roots of merit in all beings is perfection; attaining enlightenment and completing the ten strengths, the four confidences, the unique qualities, and so on, of buddhahood is perfection; the realization of the nonduality of the characteristics of saṃsāra and nirvāṇa is perfection; repeatedly benefiting beings is perfection; when tīrthikas come and ask questions, teaching them correctly and converting them is perfection; turning the twelve aspects of the excellent wheel of the Dharma is perfection; and not having attachment and being free of not seeing and of faults is perfection. “

source: །མངོན་པར་ཞེན་པ་མེད་ཅིང་མཐོང་བ་མེད་པ་དང་། སྐྱོན་དང་འབྲེལ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་སྔ་རྟགས་ཀྱི་མཚན་མ་སྣང་བ་འདི་ལྟ་སྟེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་དཔག་ཏུ་མེད་པ་རྣམས་རིན་པོ་ཆེའི་གཏེར་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཀུན་ཏུ་གང་བ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་མཐོང་བར་འགྱུར་རོ།
en: Noble one, the appearance of a sign that is the omen for the first bodhisattva bhūmi is like this: all bodhisattvas see countless, innumerable trichiliocosm world realms becoming filled with various treasures of jewels. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ས་གཉིས་པ་ལ་སྔ་རྟགས་ཀྱི་མཚན་མ་སྣང་བ་འདི་ལྟ་སྟེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ས་གཞི་ལག་མཐིལ་ལྟར་མཉམ་པ་ཁ་དོག་ཤིན་ཏུ་གྱ་ནོམ་པ་ཚད་མེད་པ་དཔག་ཏུ་མེད་པ་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ་དང་། ཡོངས་སུ་དག་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱི་རྣམ་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་མཐོང་བར་འགྱུར་རོ།
en: Noble one, the appearance of a sign that is the omen for the second bodhisattva bhūmi is like this: all bodhisattvas see that the ground in the trichiliocosm world realms has become as flat as the palm of the hand; has a variety of countless, innumerable, excellent colors; and is adorned by pure jewels. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ས་གསུམ་པ་ལ་སྔ་རྟགས་ཀྱི་མཚན་མ་སྣང་བ་འདི་ལྟ་སྟེ། བདག་ཉིད་ཀྱི་ལུས་ཤིན་ཏུ་དཔའ་ལ་གོ་ཆས་རབ་ཏུ་བརྒྱན་པས་ཕྱིར་རྒོལ་བ་ཐམས་ཅད་ཕམ་པར་བྱེད་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་མཐོང་བར་འགྱུར་རོ།
en: Noble one, the appearance of a sign that is the omen for the third bodhisattva bhūmi is like this: all bodhisattvas see themselves as a warrior adorned in armor and defeating all their adversaries. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ས་བཞི་པ་ལ་སྔ་རྟགས་ཀྱི་མཚན་མ་སྣང་བ་འདི་ལྟ་སྟེ། ཕྱོགས་བཞི་ནས་རླུང་གི་དཀྱིལ་འཁོར་གྱིས་མེ་ཏོག་དམ་པ་རྣམ་པ་སྣ་ཚོགས་མངོན་པར་གཏོར་བས་ས་གཞི་ཀུན་དུ་ཁྱབ་པར་བཀྲམ་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་མཐོང་བར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ས་ལྔ་པ་ལ་སྔ་རྟགས་ཀྱི་མཚན་མ་སྣང་བ་འདི་ལྟ་སྟེ།
en: Noble one, the appearance of a sign that is the omen for the fourth bodhisattva bhūmi is like this: all bodhisattvas see circles of wind from the four directions scattering a variety of sublime flowers that cover the earth. “

source: རིན་པོ་ཆེའི་ཕྲེང་བ་སྣ་ཚོགས་ཀྱིས་ལུས་ཀུན་ཏུ་ཁྱབ་པར་བརྒྱན་པ་མགོ་མེ་ཏོག་གི་ཅོད་པན་གྱིས་བརྒྱན་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་མཐོང་བར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ས་དྲུག་པ་ལ་སྔ་རྟགས་ཀྱི་མཚན་མ་སྣང་བ་འདི་ལྟ་སྟེ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མེ་ཏོག་གི་རྫིང་བུ་ཐེམ་སྐས་ཀྱི་ལམ་བཞི་དང་ལྡན་པ། གསེར་གྱི་བྱེ་མ་ཀུན་ཏུ་བདལ་བ། ཡོངས་སུ་དང་ཞིང་དྲི་མ་མེད་པ།
en: Noble one, the appearance of a sign that is the omen for the fifth bodhisattva bhūmi is like this: all bodhisattvas see bodies covered by the adornment of various precious jewelry and garlands of flowers adorning their heads. “

source: ཡོན་ཏན་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཀུན་ཏུ་གང་བ། མེ་ཏོག་ཨུཏྤ་ལ་དང་། ཀུ་མུ་ད་དང་། པུཎྜ་རི་ཀས་ཀུན་ཏུ་བཀྲམ་པ། མེ་ཏོག་གི་རྫིང་བུའི་ནང་ན་རྣམ་པར་རྩེན་པ་དག་ཤིན་ཏུ་བདེ་སྐྱིད་པ་དང་།
en: Noble one, the appearance of a sign that is the omen for the sixth bodhisattva bhūmi is like this: all bodhisattvas see a flower pond made of the seven precious materials, with four stairways, with a bottom of gold sand, filled with perfectly clear, aromatic water that possesses the eight good qualities and is covered by blue lotuses, night lotuses, and white lotuses, and those playing within it are very happy—it is very pure and beyond analogy. “

source: ཡོངས་སུ་དག་ཅིང་དཔེ་ཟླ་མེད་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་མཐོང་བར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་ལ་སྔ་རྟགས་ཀྱི་མཚན་མ་སྣང་བ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་མདུན་དུ་སེམས་ཅན་རྣམས་སེམས་ཅན་དམྱལ་བར་ལྟུང་བར་འགྱུར་བའི་རིགས་པ་དག་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་མཐུས་ལྟུང་བར་ཡང་མི་འགྱུར་ལ་སྨས་པ་ཡང་མེད། འཇིགས་ཤིང་སྐྲག་པ་ཡང་མེད་པར་གྱུར་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་མཐོང་བར་འགྱུར་རོ།
en: Noble one, the appearance of a sign that is the omen for the seventh bodhisattva bhūmi is like this: all bodhisattvas see before a bodhisattva those beings who are going to fall into the hells, but through the power of the bodhisattva they do not fall, are not even injured, and are not even terrified or frightened. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པ་ལ་སྔ་རྟགས་ཀྱི་མཚན་མ་སྣང་བ་འདི་ལྟ་སྟེ། བདག་ཉིད་ཀྱི་ལུས་ཀྱི་གཡས་གཡོན་ན་སེང་གེའི་རྒྱལ་པོས་ཡོངས་སུ་བསྲུངས་པས་གཅན་གཟན་མང་པོ་ཐམས་ཅད་སྐྲག་ཅིང་འཇིགས་པར་གྱུར་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་མཐོང་བར་འགྱུར་རོ།
en: Noble one, the appearance of a sign that is the omen for the eighth bodhisattva bhūmi is like this: all bodhisattvas see that to their right and left they are being guarded by lions, the kings of beasts, and an entire multitude of wild beasts are frightened and terrified of them. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་པ་ལ་སྔ་རྟགས་ཀྱི་མཚན་མ་སྣང་བ་འདི་ལྟ་སྟེ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཁོར་འབུམ་ཕྲག་ཚད་མེད་པས་ཡོངས་སུ་བསྐོར་ནས་མཆོད་པ་བྱེད་པ་དང་། སྤྱི་བོའི་གདུགས་དཀར་པོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཚད་མེད་པ་དག་གིས་རབ་ཏུ་བརྒྱན་པ་དག་བྱང་ཆུབ་སེམས་དཔས་ཐམས་ཅད་རབ་ཏུ་མཐོང་བར་འགྱུར་རོ།
en: Noble one, the appearance of a sign that is the omen for the ninth bodhisattva bhūmi is like this: all bodhisattvas see cakravartins encircled by retinues numbering many hundreds of thousands who are making offerings to them, and they are adorned by a variety of precious white parasols above their heads. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པ་ལ་སྔ་རྟགས་ཀྱི་མཚན་མ་སྣང་བ་འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་གསེར་གྱི་ཁ་དོག་ཀུན་ཏུ་འཕྲོ་བ། འོད་ཟེར་ཡོངས་སུ་དག་པ། ཚད་མེད་པ། ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་གྱུར་པ་ལ་ཚངས་པའི་རྒྱལ་པོ་འབུམ་ཕྲག་ཚད་མེད་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ནས་བཀུར་སྟི་དང་མཆོད་པ་བྱས་པས་བླ་ན་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་ཤིན་ཏུ་གྱ་ནོམ་པ་ཡོངས་སུ་བསྐོར་བ་དག་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་མཐོང་བར་འགྱུར་རོ།
en: Noble one, the appearance of a sign that is the omen for the tenth bodhisattva bhūmi is like this: all bodhisattvas see a tathāgata with a shining golden body, with pure, immeasurable light rays, every excellence, and encircled by countless hundreds of thousands of Brahmā kings who are honoring him and making offerings to him, so that he turns the extremely excellent wheel of the unsurpassable Dharma. “

source: །རིགས་ཀྱི་བུ་ས་དང་པོ་ལ་ཅིའི་ཕྱིར་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་ཞེ་ན།
en: Noble one, why is the first bhūmi called Perfect Joy?

source: འདི་ལྟར་ཐོག་མ་ཁོ་ནར་འཇིག་རྟེན་ལས་འདས་པའི་སེམས་སྔོན་མ་ཐོབ་པ་དེང་གདོད་ཐོབ་ནས་སྒྲུབ་པ་ཆེན་པོ་དག་ཇི་ལྟར་སྨོན་པ་བཞིན་དུ་མངོན་པར་གྲུབ་པར་གྱུར་པས་རབ་ཏུ་དགའ་བ་སྐྱེ་བར་འགྱུར་བའི་ཕྱིར་ས་དང་པོ་ནི་རབ་ཏུ་དགའ་བ་ཞེས་བྱའོ།
en: It is like this: first, a mind that transcends the world, which had never been previously attained, is attained at this time, and then there is the great accomplishment that is what had been prayed for, and therefore a perfect joy arises; that is why the first bhūmi is called Perfect Joy. “

source: །དྲི་མ་ཤིན་ཏུ་ཕྲ་མོ་དང་འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཉེས་པ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་གྱུར་པས་དེའི་ཕྱིར་ས་གཉིས་པ་ནི་དྲི་མ་མེད་པ་ཞེས་བྱའོ།
en: The second bhūmi is called Stainless because it is completely purified of all extremely subtle stains and of errors in conduct. “

source: །ཤེས་རབ་དང་ཏིང་ངེ་འཛིན་ཚད་མེད་པའི་འོད་ཟེར་སྣང་བར་བསྒུལ་བར་མི་ནུས་ཤིང་ཐུལ་བར་མི་འགྱུར་བ་དང་། ཐོས་པ་འཛིན་པའི་གཟུངས་རྩ་བར་གྱུར་པས་དེའི་ཕྱིར་ས་གསུམ་པ་ནི་འོད་བྱེད་པའི་ས་ཞེས་བྱའོ།
en: The third bhūmi is called Shining because there is the radiance of the light rays of measureless wisdom and samādhi, which cannot be destabilized, cannot be overcome, and which is the root of the power of retention that holds whatever has been heard. “

source: །ཤེས་རབ་ཀྱི་མེས་ཉོན་མོངས་པ་རྣམས་བསྲེགས་ནས་འོད་ཀྱི་སྣང་བ་འཕེལ་བར་བྱེད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་སྒོམ་པར་བྱེད་པས་དེའི་ཕྱིར་ས་བཞི་པ་ནི་འོད་འཕྲོ་བའི་ས་ཞེས་བྱའོ།
en: The fourth bhūmi is called Blazing because there is the fire of wisdom that incinerates all kleśas and increases the radiance of light, and there is the meditation on the factors of enlightenment. “

source: །ཐབས་མཁས་པས་བསྒོམས་པའི་ཡེ་ཤེས་མཆོག་རང་དབང་དུ་གྱུར་པ་ཤིན་ཏུ་འཐོབ་པར་དཀའ་བའི་ཕྱིར་དང་། མཐོང་བ་དང་བསྒོམས་པས་སྤང་བར་བྱ་བའི་ཉོན་མོངས་པ་གདུལ་བར་དཀའ་བ་ཐུལ་བར་གྱུར་པའི་ཕྱིར་ས་ལྔ་པ་ནི་ཤིན་ཏུ་རྒྱལ་བར་དཀའ་བ་ཞེས་བྱའོ།
en: The fifth bhūmi is called Difficult Training because there is the mastery of the supreme knowledge of meditation though skillful methods, which is extremely difficult to attain, and the kleśas that are difficult to subjugate through the paths of seeing and meditation are subjugated. “

source: །སྤྱོད་པའི་ཆོས་རྒྱུན་ཆད་པ་མེད་པར་གསལ་བར་མངོན་སུམ་དུ་གྱུར་པ་དང་། མཚན་མ་མེད་པའི་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་མངོན་སུམ་དུ་གྱུར་པས་དེའི་ཕྱིར་ས་དྲུག་པ་ནི་མངོན་སུམ་དུ་གྱུར་པ་ཞེས་བྱའོ།
en: The sixth bhūmi is called Manifested because there is the clear manifestation of the continuity of the Dharma of conduct and the manifestation of all featureless mentation. “

source: །ཟག་པ་མེད་པ་ལ་བར་ཆད་མེད་པ་དང་། མཚན་མ་མེད་པ་ཡིད་ལ་བྱེད་པ་དང་། རྣམ་པར་གྲོལ་བའི་ཏིང་ངེ་འཛིན་ཡུན་རིང་པོ་ནས་བསྒོམས་པའི་ཕྱིར་དང་། ས་དེ་རྣམ་པར་དག་ཅིང་ཐོགས་པ་མེད་པར་གྱུར་པའི་ཕྱིར་ས་བདུན་པ་ནི་རིང་དུ་སོང་བ་ཞེས་བྱའོ།
en: The seventh bhūmi is called Gone Far because there are no obstacles to that which is stainless, because of featureless mentation, because there is long meditation in liberated samādhi, and because that bhūmi is pure and unhindered. “

source: །མཚན་མ་མེད་པའི་ཡིད་ལ་བྱེད་པ་བསྒོམས་པས་རང་དབང་དུ་གྱུར་ནས་ཉོན་མོངས་པ་རྣམས་ཀྱིས་བསྒུལ་བར་མི་ནུས་པས་དེའི་ཕྱིར་ས་བརྒྱད་པ་ནི་མི་གཡོ་བ་ཞེས་བྱའོ།
en: The eighth bhūmi is called Unwavering because through attainment of the mastery of featureless mentation, the kleśas are unable to cause instability. “

source: །ཐ་དད་པར་གྱུར་པའི་ཆོས་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་བསྟན་པ་ལ་རང་དབང་ཐོབ་ནས་ཉེས་པ་མེད་ཅིང་འབྲེལ་པ་མེད་པར་ཤེས་རབ་འཕེལ་བར་བྱེད་པ་དང་། དབང་དུ་གྱུར་ཅིང་ཐོགས་པ་མེད་པར་གྱུར་པར་དེའི་ཕྱིར་ས་དགུ་པ་ནི་ལེགས་པའི་བློ་གྲོས་ཞེས་བྱའོ།
en: The ninth bhūmi is called Perfect Understanding because through the mastery of teaching all the various different kinds of Dharma, there is an increase of wisdom that is without faults or dependence and there is the attainment of unimpeded power. “

source: །ཆོས་ཀྱི་སྐུ་ནམ་མཁའ་དང་འདྲ་བ་དང་། ཤེས་རབ་སྤྲིན་ཆེན་པོ་ལྟ་བུར་གྱུར་ནས་ཐམས་ཅད་ཀུན་ཏུ་ཁྱབ་པར་གཡོགས་པར་བྱེད་པའི་ཕྱིར་དེ་ལྟ་བས་ན་ས་བཅུ་པ་ནི་ཆོས་ཀྱི་སྤྲིན་ཞེས་བྱའོ།
en: The tenth bhūmi is called Cloud of Dharma because the Dharma body is like the sky, and wisdom, having become like a great cloud, pervades everything. “

source: །རིགས་ཀྱི་བུ་བདག་དང་ཆོས་ལ་མཚན་མ་ཡོད་པར་མངོན་པར་ཞེན་པའི་མ་རིག་པ་དང་། འཁོར་བའི་ངན་འགྲོ་ལ་སྐྲག་ཅིང་འཇིགས་པའི་མ་རིག་པ་སྟེ།
en: Noble one, the first bhūmi is obscured by these two kinds of ignorance: the ignorance of attachment to the features of self and phenomena, and the ignorance of being afraid and terrified of the lower existences of saṃsāra. “

source: མ་རིག་པ་འདི་གཉིས་ཀྱིས་ནི་ས་དང་པོ་ལ་སྒྲིབ་པར་བྱེད་དོ། །བསླབ་པའི་གནས་ཤིན་ཏུ་ཕྲ་མོ་དག་ལ་ཤེས་བཞིན་མེད་པས་ཉམས་པར་བྱས་པའི་མ་རིག་པ་དང་། ལས་ཀྱི་འདུ་བྱེད་རྣམ་པ་སྣ་ཚོགས་སློང་བར་བྱེད་པའི་མ་རིག་པ་སྟེ།
en: The second bhūmi is obscured by these two kinds of ignorance: the ignorance of the lack of awareness of subtle points in the trainings so that they are transgressed, and the ignorance that adopts various kinds of activities. “

source: མ་རིག་པ་འདི་གཉིས་ཀྱིས་ནི་ས་གཉིས་པ་ལ་སྒྲིབ་པར་བྱེད་དོ། །མ་ཐོབ་པ་ཐོབ་པར་འདོད་པ་ལ་སྲེད་ཅིང་མངོན་པར་ཞེན་པའི་མ་རིག་པ་དང་། གཟུངས་ཁྱད་པར་དུ་འཕགས་པ་དག་ལ་སྒྲིབ་པར་བྱེད་པའི་མ་རིག་པ་སྟེ།
en: The third bhūmi is obscured by these two kinds of ignorance: the ignorance of the craving that wishes to attain what has not been attained, and the ignorance that obscures the superior powers of retention. “

source: མ་རིག་པ་འདི་གཉིས་ཀྱིས་ནི་ས་གསུམ་པ་ལ་སྒྲིབ་པར་བྱེད་དོ། །སྙོམས་པར་འཇུག་པའི་རོ་མྱང་བ་ལ་མངོན་པར་དགའ་བའི་མ་རིག་པ་དང་། ཤིན་ཏུ་གྱ་ནོམ་པའི་ཆོས་རྣམ་པར་དག་པ་ལ་སྲེད་ཅིང་མོས་པའི་མ་རིག་པ་སྟེ། མ་རིག་པ་འདི་གཉིས་ཀྱིས་ནི་ས་བཞི་པ་ལ་སྒྲིབ་པར་བྱེད་དོ།
en: The fourth bhūmi is obscured by these two kinds of ignorance: the ignorance that delights in the flavor of resting in meditation, and the ignorance of craving for pure, extremely excellent qualities. “
